Repository: vrivrixd/BatteryLevelAnnouncer
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, de, es, fr, hi, it, pt_pt, ru, vi

source: Battery Level Announcer
ar: مُعلن مستوى البطارية
de: Batteriestandsankündiger
es: Anunciador del Nivel de Batería
fr: Annonciateur du niveau de batterie
hi: बैटरी स्तर घोषक
it: Annunciatore del livello della batteria
pt_pt: Anunciador do Nível da Bateria
ru: Оповещатель уровня батареи
vi: Thông Báo Mức Pin

source: Battery check interval (seconds):
ar: فاصل التحقق من البطارية (ثوانٍ):
de: Prüfintervall der Batterie (Sekunden):
es: Intervalo de verificación de la batería (segundos):
fr: Intervalle de vérification de la batterie (secondes) :
hi: बैटरी जाँच अंतराल (सेकंड):
it: Intervallo di controllo della batteria (secondi):
pt_pt: Intervalo de verificação da bateria (segundos):
ru: Интервал проверки батареи (секунды):
vi: Khoảng thời gian kiểm tra pin (giây):

source: Announcement interval:
ar: فاصل الإعلان:
de: Ankündigungsintervall:
es: Intervalo de anuncio:
fr: Intervalle d'annonce :
hi: घोषणा अंतराल:
it: Intervallo di annuncio:
pt_pt: Intervalo de anúncio:
ru: Интервал оповещения:
vi: Khoảng thời gian thông báo:

source: Disabled
ar: معطل
de: Deaktiviert
es: Desactivado
fr: Désactivé
hi: अक्षम
it: Disattivato
pt_pt: Desactivado
ru: Отключено
vi: Đã tắt

source: Only when battery is full
ar: فقط عندما تكون البطارية ممتلئة
de: Nur wenn der Akku voll ist
es: Solo cuando la batería esté llena
fr: Seulement lorsque la batterie est pleine
hi: केवल जब बैटरी पूरी तरह चार्ज हो
it: Solo quando la batteria è piena
pt_pt: Apenas quando a bateria estiver cheia
ru: Только когда батарея полностью заряжена
vi: Chỉ khi pin đầy

source: Announcement mode:
ar: وضع الإعلان:
de: Ankündigungsmodus:
es: Modo de anuncio:
fr: Mode d'annonce :
hi: घोषणा मोड:
it: Modalità di annuncio:
pt_pt: Modo de anúncio:
ru: Режим оповещения:
vi: Chế độ thông báo:

source: Speech only
ar: الكلام فقط
de: Nur Sprache
es: Solo voz
fr: Voix uniquement
hi: केवल वाक्
it: Solo voce
pt_pt: Apenas voz
ru: Только речь
vi: Chỉ giọng nói

source: Sound only
ar: الصوت فقط
de: Nur Ton
es: Solo sonido
fr: Son uniquement
hi: केवल ध्वनि
it: Solo suono
pt_pt: Apenas som
ru: Только звук
vi: Chỉ âm thanh

source: Sound and Speech
ar: الصوت والكلام
de: Ton und Sprache
es: Sonido y voz
fr: Son et voix
hi: ध्वनि और वाक्
it: Suono e voce
pt_pt: Som e voz
ru: Звук и речь
vi: Âm thanh và giọng nói

source: Select announcement sound:
ar: اختر صوت الإعلان:
de: Ankündigungston auswählen:
es: Seleccionar sonido de anuncio:
fr: Sélectionner le son d'annonce :
hi: घोषणा ध्वनि चुनें:
it: Seleziona suono di annuncio:
pt_pt: Seleccionar som de anúncio:
ru: Выбрать звук оповещения:
vi: Chọn âm thanh thông báo:

source: No sounds available
ar: لا توجد أصوات متاحة
de: Keine Töne verfügbar
es: No hay sonidos disponibles
fr: Aucun son disponible
hi: कोई ध्वनि उपलब्ध नहीं
it: Nessun suono disponibile
pt_pt: Nenhum som disponível
ru: Звуки отсутствуют
vi: Không có âm thanh nào khả dụng

source: Open sounds folder
ar: فتح مجلد الأصوات
de: Tonordner öffnen
es: Abrir carpeta de sonidos
fr: Ouvrir le dossier des sons
hi: ध्वनि फ़ोल्डर खोलें
it: Apri cartella dei suoni
pt_pt: Abrir pasta de sons
ru: Открыть папку звуков
vi: Mở thư mục âm thanh

source: Failed to play sound: {error}
ar: فشل في تشغيل الصوت: {error}
de: Fehler beim Abspielen des Tons: {error}
es: No se pudo reproducir el sonido: {error}
fr: Échec de la lecture du son : {error}
hi: ध्वनि चलाने में विफल: {error}
it: Impossibile riprodurre il suono: {error}
pt_pt: Falha ao reproduzir o som: {error}
ru: Не удалось воспроизвести звук: {error}
vi: Không thể phát âm thanh: {error}

source: Error
ar: خطأ
de: Fehler
fr: Erreur
hi: त्रुटि
it: Errore
pt_pt: Erro
ru: Ошибка
vi: Lỗi

source: Failed to open sounds folder: {error}
ar: فشل في فتح مجلد الأصوات: {error}
de: Fehler beim Öffnen des Tonordners: {error}
es: No se pudo abrir la carpeta de sonidos: {error}
fr: Échec de l'ouverture du dossier des sons : {error}
hi: ध्वनि फ़ोल्डर खोलने में विफल: {error}
it: Impossibile aprire la cartella dei suoni: {error}
pt_pt: Falha ao abrir a pasta de sons: {error}
ru: Не удалось открыть папку звуков: {error}
vi: Không thể mở thư mục âm thanh: {error}

source: Please enter a valid positive integer for the battery check interval (e.g., 1, 2, 3).
ar: يرجى إدخال عدد صحيح موجب صالح لفاصل التحقق من البطارية (مثل: 1، 2، 3).
de: Bitte geben Sie eine gültige positive Ganzzahl für das Prüfintervall der Batterie ein (z. B. 1, 2, 3).
es: Por favor, introduce un entero positivo válido para el intervalo de verificación de la batería (por ejemplo, 1, 2, 3).
fr: Veuillez entrer un entier positif valide pour l'intervalle de vérification de la batterie (par exemple, 1, 2, 3).
hi: कृपया बैटरी जाँच अंतराल के लिए एक मान्य धनात्मक पूर्णांक दर्ज करें (उदाहरण: 1, 2, 3)।
it: Inserisci un numero intero positivo valido per l'intervallo di controllo della batteria (ad esempio, 1, 2, 3).
pt_pt: Por favor, introduza um número inteiro positivo válido para o intervalo de verificação da bateria (ex.: 1, 2, 3).
ru: Пожалуйста, введите действительное положительное целое число для интервала проверки батареи (например, 1, 2, 3).
vi: Vui lòng nhập một số nguyên dương hợp lệ cho khoảng thời gian kiểm tra pin (ví dụ: 1, 2, 3).

source: Invalid Input
ar: إدخال غير صالح
de: Ungültige Eingabe
es: Entrada inválida
fr: Entrée invalide
hi: अमान्य इनपुट
it: Input non valido
pt_pt: Entrada Inválida
ru: Недопустимый ввод
vi: Dữ liệu đầu vào không hợp lệ

source: Battery level: {level}%
ar: مستوى البطارية: {level}%
de: Batteriestand: {level} %
es: Nivel de batería: {level}%
fr: Niveau de batterie : {level} %
hi: बैटरी स्तर: {level}%
it: Livello della batteria: {level}%
pt_pt: Nível da bateria: {level}%
ru: Уровень батареи: {level}%
vi: Mức pin: {level}%

source: Use custom sounds for each percentage
ar: استخدام أصوات مخصصة لكل نسبة مئوية
de: Benutzerdefinierte Töne für jeden Prozentsatz verwenden
es: Usar sonidos personalizados para cada porcentaje
fr: Utiliser des sons personnalisés pour chaque pourcentage
hi: प्रत्येक प्रतिशत के लिए कस्टम ध्वनियाँ उपयोग करें
it: Usa suoni personalizzati per ogni percentuale
pt_pt: Utilizar sons personalizados para cada percentagem
ru: Использовать пользовательские звуки для каждого процента
vi: Sử dụng âm thanh tùy chỉnh cho mỗi mức phần trăm

source: Open custom sounds folder
ar: فتح مجلد الأصوات المخصصة
de: Benutzerdefinierten Tonordner öffnen
es: Abrir carpeta de sonidos personalizados
fr: Ouvrir le dossier des sons personnalisés
hi: कस्टम ध्वनि फ़ोल्डर खोलें
it: Apri cartella dei suoni personalizzati
pt_pt: Abrir pasta de sons personalizados
ru: Открыть папку пользовательских звуков
vi: Mở thư mục âm thanh tùy chỉnh

source: Failed to open custom sounds folder: {error}
ar: فشل في فتح مجلد الأصوات المخصصة: {error}
de: Fehler beim Öffnen des benutzerdefinierten Tonordners: {error}
es: No se pudo abrir la carpeta de sonidos personalizados: {error}
fr: Échec de l'ouverture du dossier des sons personnalisés : {error}
hi: कस्टम ध्वनि फ़ोल्डर खोलने में विफल: {error}
it: Impossibile aprire la cartella dei suoni personalizzati: {error}
pt_pt: Falha ao abrir a pasta de sons personalizados: {error}
ru: Не удалось открыть папку пользовательских звуков: {error}
vi: Không thể mở thư mục âm thanh tùy chỉnh: {error}

source: The custom sounds folder is empty. Please add WAV files (e.g., 5.wav, 10.wav, etc.) to the 'sounds/custom' folder for each percentage.
ar: مجلد الأصوات المخصصة فارغ. يرجى إضافة ملفات WAV (مثل: 5.wav، 10.wav، إلخ) إلى مجلد 'sounds/custom' لكل نسبة مئوية.
de: Der benutzerdefinierte Tonordner ist leer. Bitte fügen Sie WAV-Dateien (z. B. 5.wav, 10.wav usw.) für jeden Prozentsatz zum Ordner 'sounds/custom' hinzu.
es: La carpeta de sonidos personalizados está vacía. Por favor, añade archivos WAV (por ejemplo, 5.wav, 10.wav, etc.) a la carpeta 'sounds/custom' para cada porcentaje.
fr: Le dossier des sons personnalisés est vide. Veuillez ajouter des fichiers WAV (par exemple, 5.wav, 10.wav, etc.) dans le dossier 'sounds/custom' pour chaque pourcentage.
hi: कस्टम ध्वनि फ़ोल्डर खाली है। कृपया प्रत्येक प्रतिशत के लिए 'sounds/custom' फ़ोल्डर में WAV फ़ाइलें (उदाहरण: 5.wav, 10.wav, आदि) जोड़ें।
it: La cartella dei suoni personalizzati è vuota. Aggiungi file WAV (ad esempio, 5.wav, 10.wav, ecc.) alla cartella 'sounds/custom' per ogni percentuale.
pt_pt: A pasta de sons personalizados está vazia. Por favor, adicione ficheiros WAV (ex.: 5.wav, 10.wav, etc.) à pasta 'sounds/custom' para cada percentagem.
ru: Папка пользовательских звуков пуста. Пожалуйста, добавьте файлы WAV (например, 5.wav, 10.wav и т.д.) в папку 'sounds/custom' для каждого процента.
vi: Thư mục âm thanh tùy chỉnh trống. Vui lòng thêm các tệp WAV (ví dụ: 5.wav, 10.wav, v.v.) vào thư mục 'sounds/custom' cho mỗi mức phần trăm.

source: Warning
ar: تحذير
de: Warnung
es: Advertencia
fr: Avertissement
hi: चेतावनी
it: Avviso
pt_pt: Aviso
ru: Предупреждение
vi: Cảnh báo

source: The custom sounds folder was not found and may have been deleted. It has been recreated. Please restart NVDA to ensure it is fully initialized, then add WAV files (e.g., 5.wav, 10.wav, etc.) to 'sounds/custom'.
ar: لم يتم العثور على مجلد الأصوات المخصصة وقد يكون قد تم حذفه. تم إعادة إنشائه. يرجى إعادة تشغيل NVDA للتأكد من تهيئته بالكامل، ثم أضف ملفات WAV (مثل: 5.wav، 10.wav، إلخ) إلى 'sounds/custom'.
de: Der benutzerdefinierte Tonordner wurde nicht gefunden und könnte gelöscht worden sein. Er wurde neu erstellt. Bitte starten Sie NVDA neu, um sicherzustellen, dass er vollständig initialisiert ist, und fügen Sie dann WAV-Dateien (z. B. 5.wav, 10.wav usw.) zum Ordner 'sounds/custom' hinzu.
es: La carpeta de sonidos personalizados no se encontró y puede haber sido eliminada. Se ha recreado. Por favor, reinicia NVDA para asegurarte de que esté completamente inicializada y luego añade archivos WAV (por ejemplo, 5.wav, 10.wav, etc.) a la carpeta 'sounds/custom'.
fr: Le dossier des sons personnalisés n'a pas été trouvé et a peut-être été supprimé. Il a été recréé. Veuillez redémarrer NVDA pour vous assurer qu'il est complètement initialisé, puis ajoutez des fichiers WAV (par exemple, 5.wav, 10.wav, etc.) au dossier 'sounds/custom'.
hi: कस्टम ध्वनि फ़ोल्डर नहीं मिला और संभवतः हटा दिया गया था। इसे फिर से बनाया गया है। कृपया NVDA को पुनरारंभ करें ताकि यह पूरी तरह से प्रारंभ हो सके, फिर 'sounds/custom' में WAV फ़ाइलें (उदाहरण: 5.wav, 10.wav, आदि) जोड़ें।
it: La cartella dei suoni personalizzati non è stata trovata e potrebbe essere stata eliminata. È stata ricreata. Riavvia NVDA per assicurarti che sia completamente inizializzata, quindi aggiungi file WAV (ad esempio, 5.wav, 10.wav, ecc.) alla cartella 'sounds/custom'.
pt_pt: A pasta de sons personalizados não foi encontrada e pode ter sido apagada. Ela foi recriada. Por favor, reinicie o NVDA para garantir que esteja totalmente inicializada e, em seguida, adicione ficheiros WAV (ex.: 5.wav, 10.wav, etc.) à pasta 'sounds/custom'.
ru: Папка пользовательских звуков не найдена и, возможно, была удалена. Она была воссоздана. Пожалуйста, перезапустите NVDA, чтобы убедиться, что она полностью инициализирована, затем добавьте файлы WAV (например, 5.wav, 10.wav и т.д.) в папку 'sounds/custom'.
vi: Thư mục âm thanh tùy chỉnh không được tìm thấy và có thể đã bị xóa. Nó đã được tạo lại. Vui lòng khởi động lại NVDA để đảm bảo nó được khởi tạo hoàn toàn, sau đó thêm các tệp WAV (ví dụ: 5.wav, 10.wav, v.v.) vào 'sounds/custom'.

source: This computer does not have a system battery. The Battery Level Announcer will be disabled.
ar: هذا الكمبيوتر لا يحتوي على بطارية نظام. سيتم تعطيل مُعلن مستوى البطارية.
de: Dieser Computer hat keinen Systemakku. Der Batteriestandsankündiger wird deaktiviert.
es: Este ordenador no tiene una batería de sistema. El Anunciador del Nivel de Batería será desactivado.
fr: Cet ordinateur n'a pas de batterie système. L'Annonciateur du Niveau de Batterie sera désactivé.
hi: इस कंप्यूटर में सिस्टम बैटरी नहीं है। बैटरी स्तर घोषक अक्षम कर दिया जाएगा।
it: Questo computer non ha una batteria di sistema. L'Annunciatore del Livello della Batteria verrà disattivato.
pt_pt: Este computador não possui uma bateria de sistema. O Anunciador do Nível da Bateria será desactivado.
ru: Этот компьютер не имеет системной батареи. Оповещатель уровня батареи будет отключен.
vi: Máy tính này không có pin hệ thống. Thông Báo Mức Pin sẽ bị tắt.

source: No Battery Detected
ar: لم يتم اكتشاف بطارية
de: Kein Akku Erkannt
es: No se Detectó Batería
fr: Aucune Batterie Détectée
hi: कोई बैटरी नहीं मिली
it: Nessuna Batteria Rilevata
pt_pt: Nenhuma Bateria Detectada
ru: Батарея Не Обнаружена
vi: Không Phát Hiện Pin
